{"id":392,"date":"2024-04-26T23:01:38","date_gmt":"2024-04-26T23:01:38","guid":{"rendered":"https:\/\/calpremenergy.wpenginepowered.com\/?page_id=392"},"modified":"2024-04-27T01:22:42","modified_gmt":"2024-04-27T01:22:42","slug":"privacy-policy","status":"publish","type":"page","link":"https:\/\/calpremenergy.com\/privacy-policy\/","title":{"rendered":"Privacy Policy"},"content":{"rendered":"\t\t<div data-elementor-type=\"wp-page\" data-elementor-id=\"392\" class=\"elementor elementor-392\" data-elementor-post-type=\"page\">\n\t\t\t\t<div class=\"elementor-element elementor-element-aeb9c08 e-flex e-con-boxed e-con e-parent\" data-id=\"aeb9c08\" data-element_type=\"container\" data-settings=\"{&quot;background_background&quot;:&quot;classic&quot;}\">\n\t\t\t\t\t<div class=\"e-con-inner\">\n\t\t\t\t<div class=\"elementor-element elementor-element-1db25ba elementor-widget elementor-widget-heading\" data-id=\"1db25ba\" data-element_type=\"widget\" data-widget_type=\"heading.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t<style>\/*! elementor - v3.23.0 - 05-08-2024 *\/\n.elementor-heading-title{padding:0;margin:0;line-height:1}.elementor-widget-heading .elementor-heading-title[class*=elementor-size-]>a{color:inherit;font-size:inherit;line-height:inherit}.elementor-widget-heading .elementor-heading-title.elementor-size-small{font-size:15px}.elementor-widget-heading .elementor-heading-title.elementor-size-medium{font-size:19px}.elementor-widget-heading .elementor-heading-title.elementor-size-large{font-size:29px}.elementor-widget-heading .elementor-heading-title.elementor-size-xl{font-size:39px}.elementor-widget-heading .elementor-heading-title.elementor-size-xxl{font-size:59px}<\/style><h1 class=\"elementor-heading-title elementor-size-default\"><span>Privacy Policy<\/span><br><\/h1>\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t<div class=\"elementor-element elementor-element-b689880 elementor-widget elementor-widget-text-editor\" data-id=\"b689880\" data-element_type=\"widget\" data-widget_type=\"text-editor.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t<style>\/*! elementor - v3.23.0 - 05-08-2024 *\/\n.elementor-widget-text-editor.elementor-drop-cap-view-stacked .elementor-drop-cap{background-color:#69727d;color:#fff}.elementor-widget-text-editor.elementor-drop-cap-view-framed .elementor-drop-cap{color:#69727d;border:3px solid;background-color:transparent}.elementor-widget-text-editor:not(.elementor-drop-cap-view-default) .elementor-drop-cap{margin-top:8px}.elementor-widget-text-editor:not(.elementor-drop-cap-view-default) .elementor-drop-cap-letter{width:1em;height:1em}.elementor-widget-text-editor .elementor-drop-cap{float:left;text-align:center;line-height:1;font-size:50px}.elementor-widget-text-editor .elementor-drop-cap-letter{display:inline-block}<\/style>\t\t\t\t<div data-item=\"i\"><p>We recognize that you may be concerned about our use and disclosure of your personal information. Your privacy is very important to us, and the following will inform you of the information that we, California Premier Solar Construction, may collect from you, and how it is used. By using our website, www.calpremsolar.com, you are accepting the practices described in this policy.<\/p><\/div><div data-item=\"i\"><h3> <\/h3><h3><span style=\"color: #000000;\">Information Collection<\/span><\/h3><p>We may collect non-personal information, such as a domain name and IP Address. The domain name and IP address reveals nothing personal about you other than the IP address from which you have accessed our site. We may also collect information about the type of Internet browser you are using, operating system, what brought you to our Website, as well as which of our Web pages you have accessed.<\/p><p>Additionally, if you communicate with us regarding our Website or our services, we will collect any information that you provide to us in any such communication.<\/p><p>We may contact you via email in the future to tell you about specials, new products or services, or changes to this privacy policy.<\/p><\/div><div data-item=\"i\"><h3> <\/h3><h3><span style=\"color: #000000;\">Information Use<\/span><\/h3><p>We use the collected information primarily for our own internal purposes, such as providing, maintaining, evaluating, and improving our services and Website, fulfilling requests for information, and providing customer support.<\/p><\/div><div data-item=\"i\"><h3> <\/h3><h3><span style=\"color: #000000;\">Security<\/span><\/h3><p>We follow generally accepted industry standards to protect the information submitted to us, both during transmission and once we receive it.<\/p><p>If we collect sensitive information (such as credit card data), that information is encrypted and transmitted to us in a secure way. You can verify this by looking for a closed lock icon at the bottom of your web browser, or looking for &#8220;https&#8221; at the beginning of the address of the web page.<\/p><p>While we use encryption to protect sensitive information transmitted online, we also protect your information offline. Only employees who need the information to perform a specific job (for example, billing or customer service) are granted access to personally identifiable information. The computers\/servers in which we store personally identifiable information are kept in a secure environment.<\/p><\/div><div data-item=\"i\"><h3> <\/h3><h3><span style=\"color: #000000;\">Cookies<\/span><\/h3><p>We use &#8220;cookies&#8221; on this site. A cookie is a piece of data stored on a site visitor&#8217;s hard drive to help us improve your access to our site and identify repeat visitors to our site. For instance, when we use a cookie to identify you, you would not have to log in a password more than once, thereby saving time while on our site. Cookies can also enable us to track and target the interests of our users to enhance the experience on our site. Usage of a cookie is in no way linked to any personally identifiable information on our site.<\/p><\/div><div data-item=\"i\"><h3> <\/h3><h3><span style=\"color: #000000;\">Sharing<\/span><\/h3><p>We will not sell or otherwise provide the information we collect to outside third parties for the purpose of direct or indirect mass email marketing.<\/p><p>We will disclose personal information and\/or an IP address, when required by law or in the good-faith belief that such action is necessary to:<\/p><ul><li>Cooperate with the investigations of purported unlawful activities and conform to the edicts of the law or comply with legal process served on our company<\/li><li>Protect and defend the rights or property of our Website and related properties<\/li><li>Identify persons who may be violating the law, the rights of third parties, or otherwise misusing our Website or its related properties<\/li><\/ul><p>Please keep in mind that whenever you voluntarily disclose personal information online &#8211; for example through e-mail, discussion boards, or elsewhere &#8211; that information can be collected and used by others. In short, if you post personal information online that is accessible to the public, you may receive unsolicited messages from other parties in return.<\/p><p>Ultimately, you are solely responsible for maintaining the secrecy of your personal information. Please be careful and responsible whenever you are online.<\/p><\/div><div data-item=\"i\"><h3> <\/h3><h3><span style=\"color: #000000;\">Links<\/span><\/h3><p>This Website may contain links to other sites. Please be aware that we are not responsible for the content or privacy practices of such other sites. We encourage our users to be aware when they leave our site and to read the privacy statements of any other site that collects personally identifiable information.<\/p><\/div><div data-item=\"i\"><h3> <\/h3><h3><span style=\"color: #000000;\">Surveys &amp; Contests<\/span><\/h3><p>From time-to-time our site may request information via surveys or contests. Participation in these surveys or contests is completely voluntary and you may choose whether or not to participate and therefore disclose this information. Information requested may include contact information (such as name and shipping address), and demographic information (such as zip code, age). Contact information will be used to notify the winners and award prizes. Survey information will be used for purposes of monitoring or improving the use and satisfaction of this site.<\/p><\/div><div data-item=\"i\"><h3> <\/h3><h3><span style=\"color: #000000;\">Consent<\/span><\/h3><p>By using this Website, you consent to the collection and use of information as specified above. If we make changes to our Privacy Policy, we will post those changes on this page. Please review this page frequently to remain up-to-date with the information we collect, how we use it, and under what circumstances we disclose it. You must review the new Privacy Policy carefully to make sure you understand our practices and procedures.<\/p><p><strong>If you feel that we are not abiding by this privacy policy, you should contact us immediately via telephone at <\/strong><strong>(760) 489-5800 or via mail Attn: Privacy Officer, 485 Corporate Drive, Escondido, CA 92029.<\/strong><\/p><\/div>\t\t\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t","protected":false},"excerpt":{"rendered":"<p>Privacy Policy We recognize that you may be concerned about our use and disclosure of your personal information. Your privacy is very important to us, and the following will inform you of the information that we, California Premier Solar Construction, may collect from you, and how it is used. By using our website, www.calpremsolar.com, you [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"elementor_header_footer","meta":{"footnotes":""},"featured_image_src":null,"featured_image_src_square":null,"_links":{"self":[{"href":"https:\/\/calpremenergy.com\/wp-json\/wp\/v2\/pages\/392"}],"collection":[{"href":"https:\/\/calpremenergy.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/calpremenergy.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/calpremenergy.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/calpremenergy.com\/wp-json\/wp\/v2\/comments?post=392"}],"version-history":[{"count":0,"href":"https:\/\/calpremenergy.com\/wp-json\/wp\/v2\/pages\/392\/revisions"}],"wp:attachment":[{"href":"https:\/\/calpremenergy.com\/wp-json\/wp\/v2\/media?parent=392"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}